39-Rails-relationships/app/views/patients/show.html.erb

SELECT "doctors".* FROM "doctors" INNER JOIN "appointments" ON "doctors"."id" = "appointments"."doctor_id" WHERE "appointments"."patient_id" = ?  [["patient_id", 3]]
---

<% @patient.doctors.each do |doctor| %>