38- Rails-REST-CRUD-Forms/app/controllers/dogs_controller.rb

  def index
    # byebug
    @dogs = Dog.all
---
SELECT "dogs".* FROM "dogs"