38- Rails-REST-CRUD-Forms/app/controllers/owners_controller.rb

    def index
        @owners = Owner.all
---
SELECT "owners".* FROM "owners"

    def create
        @owner = Owner.create(owners_params)
---
INSERT INTO "owners" ("name", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Erin"], ["age", 27], ["created_at", "2021-05-19 15:32:50.727692"], ["updated_at", "2021-05-19 15:32:50.727692"]]

    def update
        # byebug
        # @owner = Owner.find(params[:id])
        @owner.update(owners_params)
---
UPDATE "owners" SET "name" = ?, "updated_at" = ? WHERE "owners"."id" = ?  [["name", "Vidhi"], ["updated_at", "2021-05-19 16:10:33.543417"], ["id", 2]]

    def destroy
        # byebug
        # @owner = Owner.find(params[:id])
        @owner.destroy
---
DELETE FROM "owners" WHERE "owners"."id" = ?  [["id", 2]]

    def find_owner
        @owner = Owner.find(params[:id])
---
SELECT "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]