40-Validations-Pairing-lab-review/app/views/dogs/show.html.erb

SELECT "employees".* FROM "employees" WHERE "employees"."dog_id" = ?  [["dog_id", 1]]
---
<h4> Employees: </h4>
<% @dog.employees.each do |employee| %>