40-Validations-Pairing-lab-review/app/controllers/dogs_controller.rb

    def show #"/dogs/:id"
        @dog = Dog.find(params[:id])
---
SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]