40-Validations-Pairing-lab-review/app/controllers/employees_controller.rb

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show #"/employees/:id"
        @employee = Employee.find(params[:id])

SELECT "dogs".* FROM "dogs"
---
    def new
        @employee = Employee.new
        @dogs = Dog.all

INSERT INTO "employees" ("first_name", "last_name", "alias", "title", "office", "img_url", "dog_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        # byebug
        @employee = Employee.new(employee_params)

        if @employee.valid?
            @employee.save

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "dogs".* FROM "dogs"
---
    def edit
        @employee = Employee.find(params[:id])
        @dogs = Dog.all

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "employees" SET "img_url" = ?, "updated_at" = ? WHERE "employees"."id" = ?
---
    def update
        @employee = Employee.find(params[:id])
        @employee.update(employee_params)