39-Rails-relationships/app/controllers/dogs_controller.rb

SELECT "dogs".* FROM "dogs"
---
  def index
    # byebug
    @dogs = Dog.all

SELECT "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def show
    @dog = Dog.find(params[:id])

SELECT "owners".* FROM "owners"
---
  def new
   @dog = Dog.new
   @owners = Owner.all

INSERT INTO "dogs" ("name", "age", "breed", "owner_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "richi"], ["age", 14], ["breed", "Pug"], ["owner_id", 7], ["created_at", "2021-05-20 15:06:39.170260"], ["updated_at", "2021-05-20 15:06:39.170260"]]
---
  def create
    # byebug
    @dog = Dog.create(dog_params)

SELECT "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "owners".* FROM "owners"
---
  def edit #"/dogs/:id/edit"
    @dog = Dog.find(params[:id])
    @owners = Owner.all

SELECT "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "dogs" SET "age" = ?, "owner_id" = ?, "updated_at" = ? WHERE "dogs"."id" = ?  [["age", 16], ["owner_id", 3], ["updated_at", "2021-05-20 15:13:43.925837"], ["id", 3]]
---
  def update
    # byebug
    @dog = Dog.find(params[:id])
    @dog.update(dog_params)