39-Rails-relationships/app/controllers/owners_controller.rb

SELECT "owners".* FROM "owners"
---
    def index
        @owners = Owner.all

INSERT INTO "owners" ("name", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Michael"], ["age", 29], ["created_at", "2021-05-20 14:23:40.081316"], ["updated_at", "2021-05-20 14:23:40.081316"]]
---
    def create
        @owner = Owner.create(owners_params)

UPDATE "owners" SET "age" = ?, "updated_at" = ? WHERE "owners"."id" = ?  [["age", 31], ["updated_at", "2021-05-20 14:43:43.875747"], ["id", 1]]
---
    def update
        # byebug
        # @owner = Owner.find(params[:id])
        @owner.update(owners_params)

DELETE FROM "owners" WHERE "owners"."id" = ?  [["id", 5]]
---
    def destroy
        # byebug
        # @owner = Owner.find(params[:id])
        @owner.destroy

SELECT "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def find_owner
        @owner = Owner.find(params[:id])