39-Rails-relationships/app/controllers/patients_controller.rb

SELECT "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show #"/patients/:id"
        @patient = Patient.find(params[:id])

SELECT "doctors".* FROM "doctors"
---
    def new
        @patient = Patient.new
        @doctors = Doctor.all

INSERT INTO "patients" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Andy"], ["created_at", "2021-05-20 15:55:45.273185"], ["updated_at", "2021-05-20 15:55:45.273185"]]
---
    def create
        # byebug
        @patient = Patient.create(patient_params)