41-Rails-as-an-API/Rails-Back-end/app/controllers/instructors_controller.rb

    def index
        instructors = Instructor.all
---
SELECT "instructors".* FROM "instructors"

    def create
        # byebug
        instructor = Instructor.new(instructor_params)

        if instructor.valid?
            instructor.save
---
INSERT INTO "instructors" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Rianna"], ["created_at", "2021-05-27 15:36:35.710122"], ["updated_at", "2021-05-27 15:36:35.710122"]]

    def update
        # byebug
        # instructor = Instructor.find(params[:id])
        @instructor.update(instructor_params)
---
UPDATE "instructors" SET "name" = ?, "updated_at" = ? WHERE "instructors"."id" = ?  [["name", "Vidhi"], ["updated_at", "2021-05-27 15:45:35.370084"], ["id", 1]]

    def destroy
        @instructor.destroy
---
DELETE FROM "instructors" WHERE "instructors"."id" = ?  [["id", 1]]

    def find_instructor
        @instructor = Instructor.find(params[:id])
---
SELECT "instructors".* FROM "instructors" WHERE "instructors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]