37-Rails-Intro/app/controllers/owners_controller.rb

SELECT "owners".* FROM "owners"
---
    def index
        @owners = Owner.all